In [1]:
# create a dataframe 
import pandas as pd 
df = pd.DataFrame({'testname':{0:'a',1:'b',2:'c'},
                   'pname1':{0:1,1:3,2:5},
                   'pname2':{0:2,1:4,2:6},
                   'pname3':{0:7,1:9,2:11},
                   'pname4':{0:8,1:10,2:12}})
df

  testname  pname1  pname2  pname3  pname4
0        a       1       2       7       8
1        b       3       4       9      10
2        c       5       6      11      12

In [2]:
df.shape # rows,columns # wide table

(3, 5)

In [3]:
# wide table --> lengthy table melt(unpivot)

In [8]:
df1=pd.melt(
    frame=df,
    id_vars="testname",
    value_vars=["pname1","pname2","pname3","pname4"],
    var_name="pname",
    value_name='test_results')

In [9]:
df1.shape #12 rows 3 columns

(12, 3)

In [12]:
df2=pd.pivot(data=df1, index="testname", columns="pname", values="test_results")

In [14]:
df

  testname  pname1  pname2  pname3  pname4
0        a       1       2       7       8
1        b       3       4       9      10
2        c       5       6      11      12

In [15]:
df2

pname     pname1  pname2  pname3  pname4
testname
a              1       2       7       8
b              3       4       9      10
c              5       6      11      12

In [16]:
# Concat (append)
# axis =0 > row wise append
# axis = 1 > column wise append

In [17]:
df1=pd.read_csv("data/Py_cleaning_pivot_concat1.csv")
df2=pd.read_csv("data/Py_cleaning_pivot_concat2.csv")

In [18]:
df1

         date element  value
0  2017-09-15    tmax     30
1  2017-09-15    tmin     14

In [19]:
df2

         date element  value
0  2017-09-16    tmax     32
1  2017-09-16    tmin     17

In [21]:
pd.concat([df1,df2])

         date element  value
0  2017-09-15    tmax     30
1  2017-09-15    tmin     14
0  2017-09-16    tmax     32
1  2017-09-16    tmin     17

In [22]:
pd.concat([df1,df2],ignore_index=True)

         date element  value
0  2017-09-15    tmax     30
1  2017-09-15    tmin     14
2  2017-09-16    tmax     32
3  2017-09-16    tmin     17

In [23]:
pd.concat([df1,df2],axis=1)

         date element  value        date element  value
0  2017-09-15    tmax     30  2017-09-16    tmax     32
1  2017-09-15    tmin     14  2017-09-16    tmin     17

In [24]:
# glob(now we learn)
# shutill

In [25]:
import glob

In [26]:
glob?

Type:        module
String form: <module 'glob' from 'C:\\Users\\ramreddymyla\\Anaconda3\\envs\\dl\\lib\\glob.py'>
File:        c:\users\ramreddymyla\anaconda3\envs\dl\lib\glob.py
Docstring:   Filename globbing utility.

In [27]:
glob.glob?

Signature: glob.glob(pathname, *, recursive=False)
Docstring:
Return a list of paths matching a pathname pattern.

The pattern may contain simple shell-style wildcards a la
fnmatch. However, unlike fnmatch, filenames starting with a
dot are special cases that are not matched by '*' and '?'
patterns.

If recursive is true, the pattern '**' will match any files and
zero or more directories and subdirectories.
File:      c:\users\ramreddymyla\anaconda3\envs\dl\lib\glob.py
Type:      function

In [31]:
glob.glob("data/emp_part?.csv")

['data\\emp_part1.csv', 'data\\emp_part2.csv']

In [46]:
rs = [] # list sequence 
for i in range(len(glob.glob("data/emp_part?.csv"))):
    rs.append(pd.read_csv(glob.glob("data/emp_part?.csv")[i]))
final_df=pd.concat(rs)

In [47]:
final_df

   EMPNO   ENAME        JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
0   7693   SMITH      CLERK  7902.0  17-DEC-80   960     NaN      20
1   7499   ALLEN   SALESMAN  7698.0  20-FEB-81  1600   300.0      30
2   7521    WARD   SALESMAN  7698.0  22-FEB-81  1250   500.0      30
3   7566   JONES    MANAGER  7839.0  02-APR-81  2975     NaN      20
4   7654  MARTIN   SALESMAN  7698.0  28-SEP-81  1250  1400.0      30
0   7698   BLAKE    MANAGER  7839.0  01-MAY-81  2850     NaN      30
1   7782   CLARK    MANAGER  7839.0  09-JUN-81  2450     NaN      10
2   7788   SCOTT    ANALYST  7566.0  19-APR-87  3000     NaN      20
3   7839    KING  PRESIDENT     NaN  17-NOV-81  5000     NaN      10
4   7844  TURNER   SALESMAN  7698.0  08-SEP-81  1500     0.0      30
5   7876   ADAMS      CLERK  7788.0  23-MAY-87  1100     NaN      20
6   7900   JAMES      CLERK  7698.0  03-DEC-81   950     NaN      30
7   7902    FORD    ANALYST  7566.0  03-DEC-81  3000     NaN      20
8   7934  MILLER      CLERK  7782.0  23-JAN-82  1300     NaN      10